# Working with Data Series and Frames

## Frames

Series are great for recording observations of one variable. 

However, many data sets have more than one variable. 

That’s where frames comes in.

### Getting Used to Pandas Data Structure Frames

Let’s use a 2011 surveillance report by the National Institute on Alcohol Abuse and Alcoholism1 to study frames. The report shows per capita alcohol consumption per state, per category (beer, wine, and spirits), and per year between 1977–2009.

But remember: Do not drink and do data science!

In [10]:
import pandas as pd
import numpy as np

alco2009 = pd.DataFrame ([
        (1.2,	0.22,	0.58),
        (1.31,	0.54,	1.16),
        (1.19,	0.38,	0.74),
        (1.07,	0.17,	0.6),
        (1.05,	0.55,	0.73),
        (1.22,	0.46,	1),
        (0.89,	0.59,	0.86),
        (1.31,	0.57,	1.25),
        (1.26,	1,	1.64),
        (1.21,	0.48,	0.92),
        (1.08,	0.25,	0.64),
        (1.3,	0.53,	0.75),
        (1.05,	0.92,	0.7),
        (1.22,	0.39,	0.73),
        (1.09,	0.25,	0.73),
        (1.42,	0.18,	0.72),
        (1.18,	0.14,	0.67),
        (1.11,	0.18,	0.65),
        (1.5,	0.28,	0.85),
        (1.24,	0.42,	0.83),
        (0.97,	0.37,	0.87),
        (1.02,	0.61,	0.84),
        (1.1,	0.31,	0.8),
        (1.19,	0.37,	1.04),
        (1.41,	0.11,	0.71),
        (1.3,	0.3,	0.83),
        (1.66,	0.45,	0.88),
        (1.46,	0.2,	0.68),
        (1.57,	0.58,	1.15),
        (1.72,	0.84,	1.82),
        (0.92,	0.57,	0.87),
        (1.37,	0.32,	0.74),
        (0.91,	0.46,	0.69),
        (1.1,	0.34,	0.58),
        (1.63,	0.25,	1.16),
        (1.28,	0.26,	0.47),
        (1.18,	0.18,	0.58),
        (1.28,	0.49,	0.82),
        (1.35,	0.23,	0.61),
        (1.1,	0.53,	0.92),
        (1.36,	0.24,	0.77),
        (1.53,	0.22,	0.88),
        (1.05,	0.21,	0.57),
        (1.42,	0.28,	0.58),
        (0.7,	0.17,	0.46),
        (1.36,	0.63,	0.7),
        (1.11,	0.43,	0.59),
        (1.09,	0.51,	0.74),
        (1.24,	0.1,	0.45),
        (1.49,	0.31,	1.16),
        (1.45,	0.22,	1.1)
        ],
        columns=("Beer", "Wine", "Spirits"),
        index = ("Alabama","Alaska","Arizona","Arkansas","California","Colorado","Connecticut","Delaware", \
                 "District of Columbia","Florida","Georgia","Hawaii","Idaho","Illinois","Indiana","Iowa", \
                 "Kansas","Kentucky","Louisiana","Maine","Maryland","Massachusetts","Michigan","Minnesota", \
                 "Mississippi","Missouri","Montana","Nebraska","Nevada","New Hampshire","New Jersey","New Mexico", \
                 "New York","North Carolina","North Dakota","Ohio","Oklahoma","Oregon","Pennsylvania", \
                 "Rhode Island","South Carolina","South Dakota","Tennessee","Texas","Utah","Vermont","Virginia", \
                 "Washington","West Virginia","Wisconsin","Wyoming" ))
alco2009

                      Beer  Wine  Spirits
Alabama               1.20  0.22     0.58
Alaska                1.31  0.54     1.16
Arizona               1.19  0.38     0.74
Arkansas              1.07  0.17     0.60
California            1.05  0.55     0.73
Colorado              1.22  0.46     1.00
Connecticut           0.89  0.59     0.86
Delaware              1.31  0.57     1.25
District of Columbia  1.26  1.00     1.64
Florida               1.21  0.48     0.92
Georgia               1.08  0.25     0.64
Hawaii                1.30  0.53     0.75
Idaho                 1.05  0.92     0.70
Illinois              1.22  0.39     0.73
Indiana               1.09  0.25     0.73
Iowa                  1.42  0.18     0.72
Kansas                1.18  0.14     0.67
Kentucky              1.11  0.18     0.65
Louisiana             1.50  0.28     0.85
Maine                 1.24  0.42     0.83
Maryland              0.97  0.37     0.87
Massachusetts         1.02  0.61     0.84
Michigan              1.10  0.31     0.80
Minnesota             1.19  0.37     1.04
Mississippi           1.41  0.11     0.71
Missouri              1.30  0.30     0.83
Montana               1.66  0.45     0.88
Nebraska              1.46  0.20     0.68
Nevada                1.57  0.58     1.15
New Hampshire         1.72  0.84     1.82
New Jersey            0.92  0.57     0.87
New Mexico            1.37  0.32     0.74
New York              0.91  0.46     0.69
North Carolina        1.10  0.34     0.58
North Dakota          1.63  0.25     1.16
Ohio                  1.28  0.26     0.47
Oklahoma              1.18  0.18     0.58
Oregon                1.28  0.49     0.82
Pennsylvania          1.35  0.23     0.61
Rhode Island          1.10  0.53     0.92
South Carolina        1.36  0.24     0.77
South Dakota          1.53  0.22     0.88
Tennessee             1.05  0.21     0.57
Texas                 1.42  0.28     0.58
Utah                  0.70  0.17     0.46
Vermont               1.36  0.63     0.70
Virginia              1.11  0.43     0.59
Washington            1.09  0.51     0.74
West Virginia         1.24  0.10     0.45
Wisconsin             1.49  0.31     1.16
Wyoming               1.45  0.22     1.10

You can also use a dictionary of columns to the same effect:

In [11]:
alco2009=pd.DataFrame ( { "Beer" : (1.2,1.31,1.19,1.07,1.05,1.22,0.89,1.31,1.26,1.21,1.08,1.3,1.05,1.22,1.09,1.42,1.18, \
                                    1.11,1.5,1.24,0.97,1.02,1.1,1.19,1.41,1.3,1.66,1.46,1.57,1.72,0.92,1.37,0.91,1.1,1.63, \
                                    1.28,1.18,1.28,1.35,1.1,1.36,1.53,1.05,1.42,0.7,1.36,1.11,1.09,1.24,1.49,1.45),
                          "Wine" : (0.22,0.54,0.38,0.17,0.55,0.46,0.59,0.57,1,0.48,0.25,0.53,0.92,0.39,0.25,0.18,0.14,0.18, \
                                    0.28,0.42,0.37,0.61,0.31,0.37,0.11,0.3,0.45,0.2,0.58,0.84,0.57,0.32,0.46,0.34,0.25, \
                                    0.26,0.18,0.49,0.23,0.53,0.24,0.22,0.21,0.28,0.17,0.63,0.43,0.51,0.1,0.31,0.22),
                          "Spirits" :(0.58,1.16,0.74,0.6,0.73,1,0.86,1.25,1.64,0.92,0.64,0.75,0.7,0.73,0.73,0.72,0.67, \
                                      0.65,0.85,0.83,0.87,0.84,0.8,1.04,0.71,0.83,0.88,0.68,1.15,1.82,0.87,0.74,0.69,0.58, \
                                      1.16,0.47,0.58,0.82,0.61,0.92,0.77,0.88,0.57,0.58,0.46,0.7,0.59,0.74,0.45,1.16,1.1) 
                         },
                       index = ("Alabama","Alaska","Arizona","Arkansas","California","Colorado","Connecticut","Delaware", \
                 "District of Columbia","Florida","Georgia","Hawaii","Idaho","Illinois","Indiana","Iowa", \
                 "Kansas","Kentucky","Louisiana","Maine","Maryland","Massachusetts","Michigan","Minnesota", \
                 "Mississippi","Missouri","Montana","Nebraska","Nevada","New Hampshire","New Jersey","New Mexico", \
                 "New York","North Carolina","North Dakota","Ohio","Oklahoma","Oregon","Pennsylvania", \
                 "Rhode Island","South Carolina","South Dakota","Tennessee","Texas","Utah","Vermont","Virginia", \
                 "Washington","West Virginia","Wisconsin","Wyoming" ))
                       
alco2009

                      Beer  Wine  Spirits
Alabama               1.20  0.22     0.58
Alaska                1.31  0.54     1.16
Arizona               1.19  0.38     0.74
Arkansas              1.07  0.17     0.60
California            1.05  0.55     0.73
Colorado              1.22  0.46     1.00
Connecticut           0.89  0.59     0.86
Delaware              1.31  0.57     1.25
District of Columbia  1.26  1.00     1.64
Florida               1.21  0.48     0.92
Georgia               1.08  0.25     0.64
Hawaii                1.30  0.53     0.75
Idaho                 1.05  0.92     0.70
Illinois              1.22  0.39     0.73
Indiana               1.09  0.25     0.73
Iowa                  1.42  0.18     0.72
Kansas                1.18  0.14     0.67
Kentucky              1.11  0.18     0.65
Louisiana             1.50  0.28     0.85
Maine                 1.24  0.42     0.83
Maryland              0.97  0.37     0.87
Massachusetts         1.02  0.61     0.84
Michigan              1.10  0.31     0.80
Minnesota             1.19  0.37     1.04
Mississippi           1.41  0.11     0.71
Missouri              1.30  0.30     0.83
Montana               1.66  0.45     0.88
Nebraska              1.46  0.20     0.68
Nevada                1.57  0.58     1.15
New Hampshire         1.72  0.84     1.82
New Jersey            0.92  0.57     0.87
New Mexico            1.37  0.32     0.74
New York              0.91  0.46     0.69
North Carolina        1.10  0.34     0.58
North Dakota          1.63  0.25     1.16
Ohio                  1.28  0.26     0.47
Oklahoma              1.18  0.18     0.58
Oregon                1.28  0.49     0.82
Pennsylvania          1.35  0.23     0.61
Rhode Island          1.10  0.53     0.92
South Carolina        1.36  0.24     0.77
South Dakota          1.53  0.22     0.88
Tennessee             1.05  0.21     0.57
Texas                 1.42  0.28     0.58
Utah                  0.70  0.17     0.46
Vermont               1.36  0.63     0.70
Virginia              1.11  0.43     0.59
Washington            1.09  0.51     0.74
West Virginia         1.24  0.10     0.45
Wisconsin             1.49  0.31     1.16
Wyoming               1.45  0.22     1.10

Individual frame columns can be accessed using either dictionary or object notation. 

However, to add a new column, you must use the dictionary notation.

If the object notation is used, pandas creates a new frame attribute instead. 

Just like with series, frames has a head() and a tail().

In [12]:
# dictionary notation to select a column
alco2009["Wine"].head()

Alabama       0.22
Alaska        0.54
Arizona       0.38
Arkansas      0.17
California    0.55
Name: Wine, dtype: float64

The dot-Notation (=object notation) can also be used:

In [13]:
# dot-Notation(=object notation) to select a column
alco2009.Wine.head()

Alabama       0.22
Alaska        0.54
Arizona       0.38
Arkansas      0.17
California    0.55
Name: Wine, dtype: float64

And just like series, frames support **broadcasting**: you can assign a value to all rows of a column in one assignment statement. 

The column does not even have to exist; if it doesn’t, pandas creates it.

In [14]:
# Broadcasting
alco2009["Total"] = 0
alco2009.head()

            Beer  Wine  Spirits  Total
Alabama     1.20  0.22     0.58      0
Alaska      1.31  0.54     1.16      0
Arizona     1.19  0.38     0.74      0
Arkansas    1.07  0.17     0.60      0
California  1.05  0.55     0.73      0

## Reshaping Data

The main contribution of pandas to the tabular data cause is data labeling:
association of numerical or textual labels with columns (column names) and rows (flat and hierarchical indexes).

### Indexing
**A frame index is a collection of labels assigned to the frame rows.** 

The labels have to belong to the same data type, but do not have to be unique.

In [15]:
alco2009.columns.values

array(['Beer', 'Wine', 'Spirits', 'Total'], dtype=object)

In [16]:
alco2009.index.values

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

Wieviel Bier wird in Alabama getrunken? Geben Sie beide Möglichkeiten an.

In [20]:
alco2009.head()

            Beer  Wine  Spirits  Total
Alabama     1.20  0.22     0.58      0
Alaska      1.31  0.54     1.16      0
Arizona     1.19  0.38     0.74      0
Arkansas    1.07  0.17     0.60      0
California  1.05  0.55     0.73      0

**Any column in a frame can become an index** — *functions reset_index()* and *set_index(column)* are responsible for deposing the existing index, if any, and declaring a new one, respectively.

In [18]:
alco2 = alco2009.reset_index().set_index("Beer")
alco2.head()

           index  Wine  Spirits  Total
Beer
1.20     Alabama  0.22     0.58      0
1.31      Alaska  0.54     1.16      0
1.19     Arizona  0.38     0.74      0
1.07    Arkansas  0.17     0.60      0
1.05  California  0.55     0.73      0

A frame index is an important row access tool and a relevant row identifier.
Whatever column you use as the index, it must make sense.

Once the index is in place, you can access individual rows through the row index attribute ix, which is like a dictionary of row series, keyed by the index labels.

In welchem Land ist der geringste Bierkonsum und in welchem Land der größte Bierkonsum. Dank des neuen Indexes sehr leicht  zu beantworten.

In [31]:
alco2.sort_index().head(5)

            index  Spirits  Wine  Total
Beer
0.70         Utah     0.46  0.17      0
0.89  Connecticut     0.86  0.59      0
0.91     New York     0.69  0.46      0
0.92   New Jersey     0.87  0.57      0
0.97     Maryland     0.87  0.37      0

In [32]:
alco2.sort_index(ascending=False).head(5)

              index  Spirits  Wine  Total
Beer
1.72  New Hampshire     1.82  0.84      0
1.66        Montana     0.88  0.45      0
1.63   North Dakota     1.16  0.25      0
1.57         Nevada     1.15  0.58      0
1.53   South Dakota     0.88  0.22      0

In [33]:
# Zeile eines Frames
alco2009.ix["Nebraska"]

Beer       1.46
Spirits    0.68
Wine       0.20
Total      0.00
Name: Nebraska, dtype: float64

Python operator *in* checks if a row with a certain label is present in the frame at all:

In [34]:
"Samoa" in alco2009.index

False

### Reindexing

Reindexing creates a new frame or series from an existing frame or series by
selecting possibly permuted rows, columns, or both

In the next example, we create a list of states whose names begin with “S” (including “Samoa,” which is not a state and is not in the alco2009 frame). 

Then we take all frame columns, except for the last one (“Total,” which is not properly initialized, anyway), and add another column named “Water.”

Finally, we extract the selected rows and columns from the original frame.

Because one row and one column do not exist, pandas creates them:

In [35]:
# States beginning with a "S" and an new one
s_states = [state for state in alco2009.index if state[0] == 'S'] + ["Samoa"]

s_states

['South Carolina', 'South Dakota', 'Samoa']

In [36]:
# Without list comprehension
s_states=[]
for state in alco2009.index:
    if state[0] == 'S':
        s_states.append(state)
s_states += ["Samoa"]
s_states

['South Carolina', 'South Dakota', 'Samoa']

In [37]:
# a new column with a new drink
drinks = list(alco2009.columns) + ["Water"]
drinks

['Beer', 'Spirits', 'Wine', 'Total', 'Water']

In [38]:
# Extracting the selected rows and columns from the original frame.
nan_alco = alco2009.reindex(s_states, columns=drinks)
nan_alco

                Beer  Spirits  Wine  Total  Water
South Carolina  1.36     0.77  0.24    0.0    NaN
South Dakota    1.53     0.88  0.22    0.0    NaN
Samoa            NaN      NaN   NaN    NaN    NaN

### Hierarchical Indexing

*pandas* supports hierarchical (multilevel) indexes and hierarchical (multilevel) column names. 

The multilevel indexes are also known as multiindexes.

A multilevel index consists of three lists:
+ Level names
+ All possible labels per level
+ Lists of actual values for each item in the frame or series (The lengths of the lists are the same and equal to the number of levels in the index.)

In [39]:
# Read the data from a csv file and use a hierarchical index
alco = pd.read_csv("alcohol.csv",
                 index_col = ("State", "Year"))

In [40]:
alco

              Beer  Wine  Spirits
State   Year
Alabama 1977  0.99  0.13     0.84
        1978  0.98  0.12     0.88
        1979  0.98  0.12     0.84
        1980  0.96  0.16     0.74
        1981  1.00  0.19     0.73
        1982  1.00  0.18     0.72
        1983  1.01  0.17     0.71
        1984  1.02  0.19     0.69
        1985  1.06  0.17     0.67
        1986  1.09  0.18     0.64
        1987  1.10  0.18     0.61
        1988  1.10  0.18     0.61
        1989  1.10  0.17     0.60
        1990  1.12  0.18     0.61
        1991  1.00  0.17     0.59
        1992  1.02  0.19     0.59
        1993  1.14  0.17     0.56
        1994  1.16  0.17     0.54
        1995  1.14  0.15     0.53
        1996  1.17  0.15     0.53
        1997  1.14  0.15     0.52
        1998  1.16  0.17     0.51
        1999  1.18  0.17     0.51
        2000  1.19  0.18     0.51
        2001  1.16  0.17     0.53
        2002  1.18  0.21     0.53
        2003  1.18  0.19     0.52
        2004  1.19  0.20     0.52
        2005  1.18  0.20     0.53
        2006  1.22  0.21     0.55
...            ...   ...      ...
Wyoming 1980  1.85  0.24     1.32
        1981  1.91  0.24     1.27
        1982  1.80  0.24     1.21
        1983  1.66  0.22     1.09
        1984  1.58  0.22     1.05
        1985  1.56  0.25     1.03
        1986  1.46  0.26     0.92
        1987  1.46  0.24     0.86
        1988  1.39  0.23     0.83
        1989  1.35  0.22     0.82
        1990  1.48  0.22     0.93
        1991  1.45  0.20     0.90
        1992  1.44  0.20     0.91
        1993  1.40  0.19     0.86
        1994  1.42  0.18     0.83
        1995  1.34  0.16     0.80
        1996  1.37  0.16     0.81
        1997  1.36  0.17     0.81
        1998  1.38  0.20     0.81
        1999  1.41  0.18     0.84
        2000  1.42  0.18     0.86
        2001  1.43  0.22     0.88
        2002  1.46  0.22     0.88
        2003  1.69  0.23     0.90
        2004  1.41  0.22     0.92
        2005  1.21  0.23     0.97
        2006  1.47  0.23     1.05
        2007  1.49  0.23     1.10
        2008  1.54  0.23     1.12
        2009  1.45  0.22     1.10

[1683 rows x 3 columns]

Function *MultiIndex.from_tuples()* takes a collection of tuples with labels and an optional list of level names and produces a multiindex. 

You can attach the multiindex to an existing frame or series or pass it as a parameter to the DataFrame() constructor:

    multi = pd.MultiIndex.from_tuples((  
	    ("Alabama", 1977), ("Alabama", 1978), ("Alabama", 1979), ...,    
	    ("Wyoming", 2009)),  
	    names=["State", "Year"])  
    ➾ MultiIndex(levels=[['Alabama', 'Alaska', «...», 'Wyoming'],  
    ➾ 			[1977, 1978, 1979, 1980, «...», 2009]],  
    ➾ 		labels=[[0, 0, 0, 0, 0, 0, 0, 0, «...», 50],  
    ➾ 			[0, 1, 2, 3, 4, 5, 6, 7, «...», 32]],  
    ➾		names=['State', 'Year'])  

alco.index = multi

A multiindex can be used the same way as a flat index. 

A partial selection (by one of several labels) produces a frame; a complete selection produces a series.

In [41]:
alco.ix['Wyoming'].head()

      Beer  Wine  Spirits
Year
1977  1.79  0.21     1.32
1978  1.82  0.22     1.36
1979  1.86  0.22     1.30
1980  1.85  0.24     1.32
1981  1.91  0.24     1.27

In [42]:
alco.ix['Wyoming', 1999]

Beer       1.41
Wine       0.18
Spirits    0.84
Name: (Wyoming, 1999), dtype: float64

### Stacking and Pivoting

You can fully or partially flatten a multilevel index—at the expense of introducing multilevel column names. 

You can fully or partially flatten multilevel column names—at the expense of introducing a multiindex.

![](Bild1.png)

In [43]:
alco.head(10)

              Beer  Wine  Spirits
State   Year
Alabama 1977  0.99  0.13     0.84
        1978  0.98  0.12     0.88
        1979  0.98  0.12     0.84
        1980  0.96  0.16     0.74
        1981  1.00  0.19     0.73
        1982  1.00  0.18     0.72
        1983  1.01  0.17     0.71
        1984  1.02  0.19     0.69
        1985  1.06  0.17     0.67
        1986  1.09  0.18     0.64

In [44]:
#Spalten zu Zeileneinträgen
tall_alco = alco.stack()
tall_alco.index.names = ["State","Year", "Drink"]
tall_alco.head(10)

State    Year  Drink
Alabama  1977  Beer       0.99
               Wine       0.13
               Spirits    0.84
         1978  Beer       0.98
               Wine       0.12
               Spirits    0.88
         1979  Beer       0.98
               Wine       0.12
               Spirits    0.84
         1980  Beer       0.96
dtype: float64

In [45]:
wide_alco = alco.unstack()
wide_alco.head(10)

                      Beer                                                  \
Year                  1977  1978  1979  1980  1981  1982  1983  1984  1985
State
Alabama               0.99  0.98  0.98  0.96  1.00  1.00  1.01  1.02  1.06
Alaska                1.19  1.39  1.50  1.55  1.71  1.75  1.76  1.73  1.68
Arizona               1.70  1.77  1.86  1.69  1.78  1.74  1.62  1.57  1.67
Arkansas              0.92  0.97  0.93  1.00  1.06  1.03  1.03  1.02  1.03
California            1.31  1.36  1.42  1.42  1.43  1.37  1.37  1.38  1.32
Colorado              1.43  1.64  1.68  1.57  1.63  1.64  1.57  1.51  1.47
Connecticut           1.05  1.07  1.13  1.06  1.05  1.04  1.10  1.10  1.14
Delaware              1.32  1.33  1.38  1.45  1.51  1.53  1.53  1.51  1.46
District of Columbia  1.39  1.43  1.48  1.49  1.50  1.48  1.55  1.56  1.49
Florida               1.33  1.41  1.47  1.42  1.55  1.56  1.56  1.48  1.47

                            ...  Spirits                                      \
Year                  1986  ...     2000  2001  2002  2003  2004  2005  2006
State                       ...
Alabama               1.09  ...     0.51  0.53  0.53  0.52  0.52  0.53  0.55
Alaska                1.68  ...     0.92  0.97  1.08  0.79  0.96  0.99  1.02
Arizona               1.77  ...     0.71  0.70  0.69  0.71  0.70  0.74  0.78
Arkansas              1.06  ...     0.53  0.53  0.53  0.56  0.58  0.58  0.59
California            1.36  ...     0.64  0.64  0.63  0.65  0.67  0.68  0.70
Colorado              1.47  ...     0.89  0.96  0.90  0.87  0.95  0.99  0.97
Connecticut           1.13  ...     0.74  0.74  0.74  0.77  0.79  0.79  0.84
Delaware              1.45  ...     1.05  1.06  1.10  1.17  1.28  1.25  1.28
District of Columbia  1.52  ...     1.48  1.46  1.47  1.54  1.57  1.53  1.58
Florida               1.50  ...     0.82  0.82  0.84  0.86  0.89  0.91  0.92


Year                  2007  2008  2009
State
Alabama               0.56  0.58  0.58
Alaska                1.07  1.09  1.16
Arizona               0.76  0.75  0.74
Arkansas              0.60  0.60  0.60
California            0.72  0.72  0.73
Colorado              1.00  1.01  1.00
Connecticut           0.85  0.86  0.86
Delaware              1.25  1.25  1.25
District of Columbia  1.61  1.63  1.64
Florida               0.93  0.90  0.92

[10 rows x 99 columns]

The result of the previous operation is a frame with a flat index and two-level, hierarchical column names. 

You’ll often find these kind of frames in CSV and other tabular files. You may want to stack them to make the data “more square” and easier to manage.

Stacking and unstacking are special cases of a more general operation—pivoting.

The *pivot(index,columns,values)* function converts a frame into another frame using column index as the new index, columns as the new list of column names, and column values as the data.

In the following example, alco is reorganized into a “square” frame describing wine consumption by year (new flat index) and state (column names):

## Handling Missing Data

### Deleting Missing Data

The simplest way to handle missing data is to pretend you never had it in the first place (the “See No Evil, Hear No Evil” approach). 

The *dropna()* function removes partially (how="any", default) or fully (how="all") invalid rows (axis=0, default) or columns (axis=1) and returns a “clean” copy of the object frame.

You can use optional parameter inplace=True to modify the original frame instead of creating a copy.

In [46]:
nan_alco

                Beer  Spirits  Wine  Total  Water
South Carolina  1.36     0.77  0.24    0.0    NaN
South Dakota    1.53     0.88  0.22    0.0    NaN
Samoa            NaN      NaN   NaN    NaN    NaN

In [47]:
# the “See No Evil, Hear No Evil” approach on rows
nan_alco.dropna(how="all")

                Beer  Spirits  Wine  Total  Water
South Carolina  1.36     0.77  0.24    0.0    NaN
South Dakota    1.53     0.88  0.22    0.0    NaN

In [48]:
# the “See No Evil, Hear No Evil” approach on columns
nan_alco.dropna(how="all", axis=1)

                Beer  Spirits  Wine  Total
South Carolina  1.36     0.77  0.24    0.0
South Dakota    1.53     0.88  0.22    0.0
Samoa            NaN      NaN   NaN    NaN

You cannot remove a missing value alone without destroying the frame grid.

You can remove only the whole row or column containing the “dirty” cell, and the resulting “clean” frame may be totally empty. 

Instead of seeing no evil, you will see no data.

In [49]:
# the “See No Evil, Hear No Evil” approach on rows and columns
# Instead of seeing no evil, you will have no data.
nan_alco.dropna()

Empty DataFrame
Columns: [Beer, Spirits, Wine, Total, Water]
Index: []

### Imputing Missing Data

Imputing missing values means replacing them with some “clean” values that make sense.

Two most common imputation techniques are replacing with a constant (a zero, a one, and so on) and replacing with an average taken across the “clean” values. 
But first, you need to identify what’s actually missing.


Functions *isnull()* and *notnull()* are complementary. 

They return *True* if a value is a *nan* or not a *nan*, respectively. 

According to the IEEE 754 floating point standard, the expression np.nan==np.nan is False, which makes a direct comparison impossible!

In [50]:
# First, you need to identify what’s actually missing.
nan_alco.isnull()

                 Beer Spirits   Wine  Total Water
South Carolina  False   False  False  False  True
South Dakota    False   False  False  False  True
Samoa            True    True   True   True  True

In [51]:
nan_alco.notnull()

                 Beer Spirits   Wine  Total  Water
South Carolina   True    True   True   True  False
South Dakota     True    True   True   True  False
Samoa           False   False  False  False  False

Let’s fix the “Spirits” column by imputing the average (remember that - [hyphen] is numpy’s idea of a negation operator):

In [52]:
nan_alco

                Beer  Spirits  Wine  Total  Water
South Carolina  1.36     0.77  0.24    0.0    NaN
South Dakota    1.53     0.88  0.22    0.0    NaN
Samoa            NaN      NaN   NaN    NaN    NaN

In [53]:
# Selected a column with dirty rows
sp = nan_alco['Spirits'] 
sp

South Carolina    0.77
South Dakota      0.88
Samoa              NaN
Name: Spirits, dtype: float64

In [54]:
clean = sp.notnull() # The clean rows
sp[-clean] = sp[clean].mean() 
# Impute the clean mean into the dirty rows
# has to be done row by row
nan_alco

                Beer  Spirits  Wine  Total  Water
South Carolina  1.36    0.770  0.24    0.0    NaN
South Dakota    1.53    0.880  0.22    0.0    NaN
Samoa            NaN    0.825   NaN    NaN    NaN

You have to impute the means on a column-by-column (or row-by-row) basis, but you can impute constants across the frame. 

**Function *fillna(val)* ** in its simplest form imputes val into the “holes.” Alternatively, the function propagates the last valid observation along its column (axis=0}, default) or row (axis=1) either forward (method="ffill") or backward (method="bfill"). 

The function returns a new frame or series, unless you specify the parameter inplace=True.

In [55]:
# Filling all NaNs with the constant 0
nan_alco.fillna(0)

                Beer  Spirits  Wine  Total  Water
South Carolina  1.36    0.770  0.24    0.0    0.0
South Dakota    1.53    0.880  0.22    0.0    0.0
Samoa           0.00    0.825  0.00    0.0    0.0

In [56]:
# filling with the last valid observation
nan_alco.fillna(method= "ffill")

                Beer  Spirits  Wine  Total  Water
South Carolina  1.36    0.770  0.24    0.0    NaN
South Dakota    1.53    0.880  0.22    0.0    NaN
Samoa           1.53    0.825  0.22    0.0    NaN

## Replacing Values

Another way to handle specific “dirty” values is to replace them selectively by “clean” values on a case-by-case basis. 

The *replace(val_or_list,new_val)* function replaces one value or a list of values by another value or a list of values.


## Combining Data

### Merging

If both frames have a column with the same name (the key column), you can merge the frames on that column. 

The U.S. Census Bureau data is used to build a frame with the United States population as of July 1, 2009. In addition to the state-by-state data, the frame also has observations for Northwest, Midwest, West, South, and the United States as a whole.

In [57]:
# the first frame
population =pd.DataFrame ( { "Population" : (4708708,698473,6595778,2889450,36961664,5024748,3518288,885122,599657, \
                                            18537969,9829211,1295178,1545801,12910409,6423113,3007856,2818747, \
                                            4314113,4492076,1318301,5699478,6593587,9969727,5266214,2951996,5987580, \
                                            974989,1796619,2643085,1324575,8707739,2009671,19541453,9380884,646844, \
                                            11542645,3687050,3825657,12604767,1053209,4561242,812383,6296254,24782302, \
                                            2784572,621760,7882590,6664195,1819777,5654774,544270)

                         },
                       index = ("Alabama","Alaska","Arizona","Arkansas","California","Colorado","Connecticut","Delaware", \
                 "District of Columbia","Florida","Georgia","Hawaii","Idaho","Illinois","Indiana","Iowa", \
                 "Kansas","Kentucky","Louisiana","Maine","Maryland","Massachusetts","Michigan","Minnesota", \
                 "Mississippi","Missouri","Montana","Nebraska","Nevada","New Hampshire","New Jersey","New Mexico", \
                 "New York","North Carolina","North Dakota","Ohio","Oklahoma","Oregon","Pennsylvania", \
                 "Rhode Island","South Carolina","South Dakota","Tennessee","Texas","Utah","Vermont","Virginia", \
                 "Washington","West Virginia","Wisconsin","Wyoming" ))

population.index.name = "State"

population.head(10)

                      Population
State
Alabama                  4708708
Alaska                    698473
Arizona                  6595778
Arkansas                 2889450
California              36961664
Colorado                 5024748
Connecticut              3518288
Delaware                  885122
District of Columbia      599657
Florida                 18537969

In [58]:
# the second frame 
alco2009=pd.DataFrame ( { "Beer" : (1.2,1.31,1.19,1.07,1.05,1.22,0.89,1.31,1.26,1.21,1.08,1.3,1.05,1.22,1.09,1.42,1.18, \
                                    1.11,1.5,1.24,0.97,1.02,1.1,1.19,1.41,1.3,1.66,1.46,1.57,1.72,0.92,1.37,0.91,1.1,1.63, \
                                    1.28,1.18,1.28,1.35,1.1,1.36,1.53,1.05,1.42,0.7,1.36,1.11,1.09,1.24,1.49,1.45),
                          "Wine" : (0.22,0.54,0.38,0.17,0.55,0.46,0.59,0.57,1,0.48,0.25,0.53,0.92,0.39,0.25,0.18,0.14,0.18, \
                                    0.28,0.42,0.37,0.61,0.31,0.37,0.11,0.3,0.45,0.2,0.58,0.84,0.57,0.32,0.46,0.34,0.25, \
                                    0.26,0.18,0.49,0.23,0.53,0.24,0.22,0.21,0.28,0.17,0.63,0.43,0.51,0.1,0.31,0.22),
                          "Spirits" :(0.58,1.16,0.74,0.6,0.73,1,0.86,1.25,1.64,0.92,0.64,0.75,0.7,0.73,0.73,0.72,0.67, \
                                      0.65,0.85,0.83,0.87,0.84,0.8,1.04,0.71,0.83,0.88,0.68,1.15,1.82,0.87,0.74,0.69,0.58, \
                                      1.16,0.47,0.58,0.82,0.61,0.92,0.77,0.88,0.57,0.58,0.46,0.7,0.59,0.74,0.45,1.16,1.1) 
                         },
                       index = ("Alabama","Alaska","Arizona","Arkansas","California","Colorado","Connecticut","Delaware", \
                 "District of Columbia","Florida","Georgia","Hawaii","Idaho","Illinois","Indiana","Iowa", \
                 "Kansas","Kentucky","Louisiana","Maine","Maryland","Massachusetts","Michigan","Minnesota", \
                 "Mississippi","Missouri","Montana","Nebraska","Nevada","New Hampshire","New Jersey","New Mexico", \
                 "New York","North Carolina","North Dakota","Ohio","Oklahoma","Oregon","Pennsylvania", \
                 "Rhode Island","South Carolina","South Dakota","Tennessee","Texas","Utah","Vermont","Virginia", \
                 "Washington","West Virginia","Wisconsin","Wyoming" ))

alco2009.index.name="State"
                       
alco2009.head(10)

                      Beer  Spirits  Wine
State
Alabama               1.20     0.58  0.22
Alaska                1.31     1.16  0.54
Arizona               1.19     0.74  0.38
Arkansas              1.07     0.60  0.17
California            1.05     0.73  0.55
Colorado              1.22     1.00  0.46
Connecticut           0.89     0.86  0.59
Delaware              1.31     1.25  0.57
District of Columbia  1.26     1.64  1.00
Florida               1.21     0.92  0.48

Because both population and alco2009 are indexed by “State,” you can remove the indexes, merge both frames on all common columns, and observe population side-by-side with alcohol consumption:

In [59]:
# remove the index
# merge both frames on all common columns
# reindex on State
df = pd.merge(alco2009.reset_index(), population.reset_index()).set_index("State")
df.head()

            Beer  Spirits  Wine  Population
State
Alabama     1.20     0.58  0.22     4708708
Alaska      1.31     1.16  0.54      698473
Arizona     1.19     0.74  0.38     6595778
Arkansas    1.07     0.60  0.17     2889450
California  1.05     0.73  0.55    36961664

If you want to merge on indexes rather than general columns, use optional parameters left_index=True and/or right_index=True.

The result of the following statement is the same as the one previous, but the default sorting order may be different:

In [60]:
df = pd.merge(alco2009, population, left_index=True, right_index=True)
df.head()

            Beer  Spirits  Wine  Population
State
Alabama     1.20     0.58  0.22     4708708
Alaska      1.31     1.16  0.54      698473
Arizona     1.19     0.74  0.38     6595778
Arkansas    1.07     0.60  0.17     2889450
California  1.05     0.73  0.55    36961664

If both indexes are designated as keys, you can use join() instead of merge():

In [61]:
population.join(alco2009).tail(10)

               Population  Beer  Spirits  Wine
State
South Dakota       812383  1.53     0.88  0.22
Tennessee         6296254  1.05     0.57  0.21
Texas            24782302  1.42     0.58  0.28
Utah              2784572  0.70     0.46  0.17
Vermont            621760  1.36     0.70  0.63
Virginia          7882590  1.11     0.59  0.43
Washington        6664195  1.09     0.74  0.51
West Virginia     1819777  1.24     0.45  0.10
Wisconsin         5654774  1.49     1.16  0.31
Wyoming            544270  1.45     1.10  0.22

Both functions join() and merge() take an optional parameter how with the acceptable values of "left" (default for join()), "right", "inner" (default for merge()), or "outer". 
+ Left join uses the calling (left) frame’s index. 
+ Right join uses the parameter (right) frame’s index. 
+ Outer join uses the union of the indexes.
+ Inner join uses the intersection of the indexes.

### Concatenating
The *concat()* function concatenates a list of frames by placing them next to each other in one of the dimensions, “vertical” (axis=0, default) or “horizontal” (axis=1), and returns a new frame:

In [62]:
pd.concat([alco2009, population], axis=1).tail()

               Beer  Spirits  Wine  Population
State
Virginia       1.11     0.59  0.43     7882590
Washington     1.09     0.74  0.51     6664195
West Virginia  1.24     0.45  0.10     1819777
Wisconsin      1.49     1.16  0.31     5654774
Wyoming        1.45     1.10  0.22      544270

Let’s use data from the Statistics Canada Web Site to create a frame that has the population of Canadian provinces in 2011. Now we can create a new frame that describes both North American countries in a properly indexed way. (Remember that the US frame is two years older than the Canadian one.)

In [63]:
pop_ca = pd.DataFrame ({ "Population": 
        (5250,1440,944500,755500,8007700,13263500,1233700,1066300,3790200,4499100,354900,43500,34200)
        },
        index = ("Newfoundland and Labrador","Prince Edward Island","Nova Scotia","New Brunswick", \
                 "Quebec","Ontario","Manitoba","Saskatchewan","Alberta","British Columbia","Yukon", \
                 "Northwest Territories","Nunavut"))
    
pop_ca

                           Population
Newfoundland and Labrador        5250
Prince Edward Island             1440
Nova Scotia                    944500
New Brunswick                  755500
Quebec                        8007700
Ontario                      13263500
Manitoba                      1233700
Saskatchewan                  1066300
Alberta                       3790200
British Columbia              4499100
Yukon                          354900
Northwest Territories           43500
Nunavut                         34200

In [64]:
pop_na = pd.concat([population, pop_ca], keys=["US", "CA"])
pop_na.index.names = ("Country", "State")
pop_na

                                   Population
Country State
US      Alabama                       4708708
        Alaska                         698473
        Arizona                       6595778
        Arkansas                      2889450
        California                   36961664
        Colorado                      5024748
        Connecticut                   3518288
        Delaware                       885122
        District of Columbia           599657
        Florida                      18537969
        Georgia                       9829211
        Hawaii                        1295178
        Idaho                         1545801
        Illinois                     12910409
        Indiana                       6423113
        Iowa                          3007856
        Kansas                        2818747
        Kentucky                      4314113
        Louisiana                     4492076
        Maine                         1318301
        Maryland                      5699478
        Massachusetts                 6593587
        Michigan                      9969727
        Minnesota                     5266214
        Mississippi                   2951996
        Missouri                      5987580
        Montana                        974989
        Nebraska                      1796619
        Nevada                        2643085
        New Hampshire                 1324575
...                                       ...
        North Dakota                   646844
        Ohio                         11542645
        Oklahoma                      3687050
        Oregon                        3825657
        Pennsylvania                 12604767
        Rhode Island                  1053209
        South Carolina                4561242
        South Dakota                   812383
        Tennessee                     6296254
        Texas                        24782302
        Utah                          2784572
        Vermont                        621760
        Virginia                      7882590
        Washington                    6664195
        West Virginia                 1819777
        Wisconsin                     5654774
        Wyoming                        544270
CA      Newfoundland and Labrador        5250
        Prince Edward Island             1440
        Nova Scotia                    944500
        New Brunswick                  755500
        Quebec                        8007700
        Ontario                      13263500
        Manitoba                      1233700
        Saskatchewan                  1066300
        Alberta                       3790200
        British Columbia              4499100
        Yukon                          354900
        Northwest Territories           43500
        Nunavut                         34200

[64 rows x 1 columns]

### To Merge or to Concatenate?

+ Both *merge()* and *concat()* combine two or more frames. 

+ Use *concat()* to combine frames that have similar content (such as populations of U.S. states and Canadian provinces: “apples to apples”). 

+ Use *merge()* to combine frames that have complementary content (such as populations and alcohol consumption rates: “apples to oranges”).

### Deleting Duplicates

+ The *duplicated([subset])* function returns a Boolean series denoting if each row in all or subset (a list of column names) columns is duplicated. 

+ The *drop_duplicates()* function returns a copy of a frame or series with duplicates from all or subset (a list of column names) columns removed.

## Ordering and Describung Data

### Sorting and Ranking

Series and frames can be sorted by index or by value (values). 

#### The *sort_index()* function
The *sort_index()* function returns a frame sorted by the index (it does not work for series). 

The sorting order is always lexicographic (numeric for numbers, alphabetic for strings), and you can use the ascending parameter (default True) to control it.

The option inplace=True, as always, insists that pandas sorts the original frame.

In [65]:
# the sort_index() function 
population.sort_index().head()

            Population
State
Alabama        4708708
Alaska          698473
Arizona        6595778
Arkansas       2889450
California    36961664

#### The *sort_values()* function
The *sort_values()* function returns a frame or a series sorted by values. 

In the case of a frame, the first parameter is a column name or a list of column names, and the optional parameter ascending can be a Boolean value or a list of Boolean values (one per column used for sorting). 

The parameter na_position ("first" or "last") specifies where to place the nans (at the beginning or at the end).

In [66]:
# The sort_values() function 
population.sort_values("Population").head()

                      Population
State
Wyoming                   544270
District of Columbia      599657
Vermont                   621760
North Dakota              646844
Alaska                    698473

#### The *rank()* function
The *rank()* function computes a frame or a series of numerical ranks for each frame or series value. 

If several values are equal, the function assigns them all the average rank. 

Boolean parameter numeric_only restricts ranking only to numeric values. 

The parameter na_option ("top", "bottom", or "keep") specifies how to treat nans: move them to the top or to the bottom of the result frame or keep them wherever they were in the original frame.

In [67]:
# The rank function
pop_by_state = population.sort_index()
pop_by_state.rank().head()

            Population
State
Alabama           29.0
Alaska             5.0
Arizona           38.0
Arkansas          20.0
California        51.0

## Descriptive Statistics

Descriptive statistical functions calculate *sum()*, *mean()*, *median()*, standard deviation *std()*, *count()*, *min()*, and *max()* of a series or each column in a frame.

Each of them can take the Boolean parameter *skipna*, which specifies if nans must be excluded from the analysis, and axis, which tells the function which way to go (“vertically” or “horizontally”).

In [68]:
alco2009.max()

Beer       1.72
Spirits    1.82
Wine       1.00
dtype: float64

In [69]:
alco2009.min(axis=1).head()

State
Alabama       0.22
Alaska        0.54
Arizona       0.38
Arkansas      0.17
California    0.55
dtype: float64

In [70]:
alco2009.sum()

Beer       63.22
Spirits    41.81
Wine       19.59
dtype: float64

In [71]:
# altogether now
alco2009.describe()

            Beer    Spirits       Wine
count  51.000000  51.000000  51.000000
mean    1.239608   0.819804   0.384118
std     0.210200   0.266732   0.201139
min     0.700000   0.450000   0.100000
25%     1.095000   0.660000   0.225000
50%     1.220000   0.740000   0.340000
75%     1.365000   0.880000   0.520000
max     1.720000   1.820000   1.000000

#### Functions argmax() (for series) and idxmax() (for frames
Functions *argmax()* (for series) and *idxmax()* (for frames) find the index positions of the first occurrences of the maximal values. 

It’s easy to remember these two functions: these are the only two functions in pandas that do not treat series and frames consistently.

#### Cumulative methods
pandas has limited support for pseudo-integration, pseudo-differentiation, and other cumulative methods. 

Functions *cumsum()*, *cumprod()*, *cummin()*, and *cummax()* calculate cumulative sums, products, minimums, and maximums, starting from the first item in the series or each frame column.

In [72]:
alco.ix['Hawaii'].cumsum().head()

      Beer  Wine  Spirits
Year
1977  1.61  0.36     1.26
1978  2.99  0.82     2.56
1979  4.59  1.26     3.84
1980  6.24  1.72     5.05
1981  7.98  2.16     6.21

The *diff()* function calculates the running difference between the consecutive column/series items. 

The first row of the result is undefined.

In [73]:
alco.ix['Hawaii'].diff().head()

      Beer  Wine  Spirits
Year
1977   NaN   NaN      NaN
1978 -0.23  0.10     0.04
1979  0.22 -0.02    -0.02
1980  0.05  0.02    -0.07
1981  0.09 -0.02    -0.05

### Uniqueness, Counting, Membership

In [74]:
dna = "AGTCCGCGAATACAGGCTCGGT"
# Convert the string to a Series to use Series functionality
dna_as_series = pd.Series(list(dna), name="genes")
dna_as_series.head()

0    A
1    G
2    T
3    C
4    C
Name: genes, dtype: object

#### Functions unique() and value_counts()
Functions *unique()* and *value_counts()* compute an array of distinct values from the series and a frame with the counts of each distinct value, respectively. 

If the series contains nans, they are included in the count.

In [75]:
dna_as_series.unique()

array(['A', 'G', 'T', 'C'], dtype=object)

In [76]:
dna_as_series.value_counts().sort_index()

A    5
C    6
G    7
T    4
Name: genes, dtype: int64

Are all our nucleotides valid?

In [77]:
valid_nucs = list("ACGT")
dna_as_series.isin(valid_nucs).all()

True

## Transforming Data

### Arithmetic Operations

Correct the “Total” column of the *alco* frame:

In [78]:
alco["Total"] = alco.Wine + alco.Spirits + alco.Beer
alco.head()

              Beer  Wine  Spirits  Total
State   Year
Alabama 1977  0.99  0.13     0.84   1.96
        1978  0.98  0.12     0.88   1.98
        1979  0.98  0.12     0.84   1.94
        1980  0.96  0.16     0.74   1.86
        1981  1.00  0.19     0.73   1.92

Measure total consumptions on a logarithmic scale.

In [79]:
np.log10(alco.Total).head()

State    Year
Alabama  1977    0.292256
         1978    0.296665
         1979    0.287802
         1980    0.269513
         1981    0.283301
Name: Total, dtype: float64

All arithmetic operations preserve indexing.

In [81]:
dna = "AGTCCGCGAATACAGGCTCGGT"
# mutate the gene
dna1 = dna.replace("C", "")
dna2 = dna.replace("T", "")

dna_as_series1 = pd.Series(list(dna1), name="genes") # No C's
dna_as_series1
#dna_as_series2 = pd.Series(list(dna2), name="genes") # No T's
#dna_as_series1.value_counts() + dna_as_series2.value_counts()

0     A
1     G
2     T
3     G
4     G
5     A
6     A
7     T
8     A
9     A
10    G
11    G
12    T
13    G
14    G
15    T
Name: genes, dtype: object

In [82]:
dna_as_series2 = pd.Series(list(dna2), name="genes") # No T's
dna_as_series1.value_counts() + dna_as_series2.value_counts()

A    10.0
C     NaN
G    14.0
T     NaN
Name: genes, dtype: float64

### Data Aggregation

Data aggregation is a three-step procedure during which data is split, aggregated,
and combined:
1. At the split step, the data is split by key or keys into chunks.
2. At the apply step, an aggregation function (such as sum() or count()) is
applied to each chunk.
3. At the combine step, the calculated results are combined into a new series
or frame.

#### The groupby() function
The *groupby()* function splits a frame by collecting the rows in groups based
on the values of one or more categorical keys

In [95]:
# We want to group by the "Year" column
alco_noidx = alco.reset_index()
sum_alco = alco_noidx.groupby("Year").sum()
sum_alco.tail()

       Beer   Wine  Spirits
Year
2005  63.49  18.06    38.89
2006  64.37  18.66    40.15
2007  64.67  19.08    40.97
2008  64.67  19.41    41.59
2009  63.22  19.59    41.81

Sometimes you may wish you could group rows by a computable property
rather than by the existing column or columns. pandas allows data aggregation
through mappings using dictionaries or series. Let’s consider a dictionary
that maps states to the regions defined by the U.S. Census Bureau:

In [96]:
# mapping states to regions
state2reg = {
                 "Alabama": "South","Alaska": "West" ,"Arizona": "West" ,"Arkansas" : "South" ,"California" : "West" ,\
                 "Colorado": "West", "Connecticut" : "Northeast" ,"Delaware" : "South", \
                 "District of Columbia": "South" ,"Florida" : "South", "Georgia" : "South", \
                 "Hawaii" : "West", "Idaho" : "West" ,"Illinois" : "Midwest" ,"Indiana" : "Midwest" ,"Iowa" : "Midwest", \
                 "Kansas" : "Midwest", "Kentucky" : "South", "Louisiana" : "South" ,"Maine" : "Northeast" , \
                 "Maryland" :  "Sout", "Massachusetts" : "Northeast", "Michigan" : "Midwest", "Minnesota" : "Midwest", \
                 "Mississippi" : "South" ,"Missouri" : "Midwest" ,"Montana" : "West" ,"Nebraska" : "Midwest" , \
                 "Nevada" : "West" ,"New Hampshire" : "Northeast", "New Jersey" : "Northeast", "New Mexico" : "West", \
                 "New York" : "Northeast" ,"North Carolina" : "South" ,"North Dakota" : "Midwest" ,"Ohio" : "Midwest", \
                 "Oklahoma" : "South", "Oregon" : "West", "Pennsylvania" : "Northeast", \
                 "Rhode Island" : "Northeast", "South Carolina" : "South","South Dakota" : "Midwest", \
                 "Tennessee" : "South", "Texas" : "South", "Utah" : "West", "Vermont" : "Northeast","Virginia" : "South", \
                 "Washington" : "West", "West Virginia" : "South", "Wisconsin" : "Midwest", "Wyoming" : "West"
    }

In [97]:
# using the mapping for aggregation
alco2009.groupby(state2reg).mean()

               Beer   Spirits      Wine
Midwest    1.324167  0.822500  0.265000
Northeast  1.167778  0.904444  0.542222
Sout       0.970000  0.870000  0.370000
South      1.225625  0.747500  0.315000
West       1.249231  0.843846  0.470769

## Discretization

Discretization refers to the conversion of a continuous variable to a discrete
(categorical) variable often for the purpose of histogramming.

#### The cut() function
The *cut()* function splits an array or series passed as the first parameter into
half-open bins—categories. The second parameter is either a number of
equally sized bins or a list of bins’ edges

In [98]:
# Wine consumption discretizated in 3 bins
cats = pd.cut(alco2009['Wine'], 3).head()
cats

State
Alabama       (0.0991, 0.4]
Alaska           (0.4, 0.7]
Arizona       (0.0991, 0.4]
Arkansas      (0.0991, 0.4]
California       (0.4, 0.7]
Name: Wine, dtype: category
Categories (3, object): [(0.0991, 0.4] < (0.4, 0.7] < (0.7, 1]]

If you prefer to mint your own category labels, pass another optional parameter
labels (a list of N labels, one label per bin).

In [83]:
# Wine consumption discretizated in 3 bins with own category labels
cats = pd.cut(alco2009['Wine'], 3, labels=("Low", "Moderate", "Heavy"))
cats.head()

State
Alabama            Low
Alaska        Moderate
Arizona            Low
Arkansas           Low
California    Moderate
Name: Wine, dtype: category
Categories (3, object): [Low < Moderate < Heavy]

If you set *labels=False, cut()* numbers the bins instead of labeling them and
returns only the bin membership information

In [84]:
# returning only the membership information
cats = pd.cut(alco2009['Wine'], 3, labels=False).head()
cats

State
Alabama       0
Alaska        1
Arizona       0
Arkansas      0
California    1
Name: Wine, dtype: int64

#### The qcuts() function
The *qcuts()* function is similar to cuts(), but operates in terms of quantiles.

In [85]:
quants = pd.qcut(alco2009['Wine'], 3, labels=("Low", "Moderate", "Heavy"))
quants.head()

State
Alabama            Low
Alaska           Heavy
Arizona       Moderate
Arkansas           Low
California       Heavy
Name: Wine, dtype: category
Categories (3, object): [Low < Moderate < Heavy]

### Mapping

Mapping is the most general form of data transformation. 

It uses the map() function to apply an arbitrary one-argument function to each element of a selected column.

As an example, let’s create three-letter abbreviations of state names.

In [86]:
with_state = alco2009.reset_index()
abbrevs = with_state["State"].map(lambda x: x[:3].upper())
abbrevs.head()

0    ALA
1    ALA
2    ARI
3    ARK
4    CAL
Name: State, dtype: object

### Cross-Tabulation

Cross-tabulation computes group frequencies and returns a frame with rows and columns representing different values of two categorical variables (factors).

If you supply the optional parameter margins=True, the function also calculates rows and columns subtotals.

In [88]:
wine_state = alco2009["Wine"] > alco2009["Wine"].mean()
beer_state = alco2009["Beer"] > alco2009["Beer"].mean()
pd.crosstab(wine_state, beer_state)

Beer   False  True
Wine
False     14     15
True      12     10